question and answer

In [ ]:
#Sample dataset: Employee records
data = {
    'Employee_ID': [101, 102, 103, 104, 105],
    'Name': ['John', 'Emily', 'Michael', 'Sarah', 'David'],
    'Department': ['HR', 'Finance', 'IT', 'Marketing', 'Sales'],
    'Salary': [60000, 70000, 80000, 75000, 65000],
    'Age': [35, 28, 42, 30, 38]
}

In [ ]:
#1. What is the function to create a DataFrame in pandas?

data = {
    'Employee_ID': [101, 102, 103, 104, 105],
    'Name': ['John', 'Emily', 'Michael', 'Sarah', 'David'],
    'Department': ['HR', 'Finance', 'IT', 'Marketing', 'Sales'],
    'Salary': [60000, 70000, 80000, 75000, 65000],
    'Age': [35, 28, 42, 30, 38]
}
df = pd.DataFrame(data)
df

   Employee_ID     Name Department  Salary  Age
0          101     John         HR   60000   35
1          102    Emily    Finance   70000   28
2          103  Michael         IT   80000   42
3          104    Sarah  Marketing   75000   30
4          105    David      Sales   65000   38

In [ ]:
#2. How can you display the first 5 rows of a DataFrame?

df.head()

   Employee_ID     Name Department  Salary  Age
0          101     John         HR   60000   35
1          102    Emily    Finance   70000   28
2          103  Michael         IT   80000   42
3          104    Sarah  Marketing   75000   30
4          105    David      Sales   65000   38

In [ ]:
#3. How do you check the dimensions of a DataFrame?
df.shape

(5, 5)

In [ ]:
#4. What method is used to check for missing values in a DataFrame?
df.isnull().sum()

Employee_ID    0
Name           0
Department     0
Salary         0
Age            0
dtype: int64

In [ ]:
#5. How do you select a single column from a DataFrame?
single_columns = df['Salary']
single_columns

0    60000
1    70000
2    80000
3    75000
4    65000
Name: Salary, dtype: int64

In [ ]:
#6. How do you rename a specific column in a DataFrame?
df.rename(columns={'Name':"Employee name"},inplace=True)
df

   Employee_ID Employee name Department  Salary  Age
0          101          John         HR   60000   35
1          102         Emily    Finance   70000   28
2          103       Michael         IT   80000   42
3          104         Sarah  Marketing   75000   30
4          105         David      Sales   65000   38

In [ ]:
#7. What method is used to drop rows with missing values in a DataFrame?
clear = df.dropna()
clear

   Employee_ID Employee name Department  Salary  Age
0          101          John         HR   60000   35
1          102         Emily    Finance   70000   28
2          103       Michael         IT   80000   42
3          104         Sarah  Marketing   75000   30
4          105         David      Sales   65000   38

In [ ]:
df.dropna(subset=['Age', 'Salary'])
df

   Employee_ID Employee name Department  Salary  Age
0          101          John         HR   60000   35
1          102         Emily    Finance   70000   28
2          103       Michael         IT   80000   42
3          104         Sarah  Marketing   75000   30
4          105         David      Sales   65000   38

In [ ]:
#8. How can you filter rows in a DataFrame based on a condition?
print(df.head(3))
print(df.tail(3))

   Employee_ID Employee name Department  Salary  Age
0          101          John         HR   60000   35
1          102         Emily    Finance   70000   28
2          103       Michael         IT   80000   42
   Employee_ID Employee name Department  Salary  Age
2          103       Michael         IT   80000   42
3          104         Sarah  Marketing   75000   30
4          105         David      Sales   65000   38

In [ ]:
#9. What function can be used to apply a function to each element of a DataFrame column?
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'Age': [25, 30, 35, 40, 45, 50]
}

data = pd.DataFrame(data)


def square_age(x):
    return x+2


data['Age_add'] = data['Age'].apply(square_age)

print(df)

   Employee_ID Employee name Department  Salary  Age
0          101          John         HR   60000   35
1          102         Emily    Finance   70000   28
2          103       Michael         IT   80000   42
3          104         Sarah  Marketing   75000   30
4          105         David      Sales   65000   38

In [ ]:
#10. How do you sort a DataFrame by values in a specific column?
df.sort_values(by='Salary',ascending=True)

   Employee_ID Employee name Department  Salary  Age
0          101          John         HR   60000   35
4          105         David      Sales   65000   38
1          102         Emily    Finance   70000   28
3          104         Sarah  Marketing   75000   30
2          103       Michael         IT   80000   42

In [ ]:
#11. What method can you use to create a new column based on existing columns in a DataFrame?
df['Name1'] = df['Employee name'].str.upper()
df

   Employee_ID Employee name Department  Salary  Age    Name1
0          101          John         HR   60000   35     JOHN
1          102         Emily    Finance   70000   28    EMILY
2          103       Michael         IT   80000   42  MICHAEL
3          104         Sarah  Marketing   75000   30    SARAH
4          105         David      Sales   65000   38    DAVID

In [ ]:
#12. How can you save a DataFrame to a CSV file?
df.to_csv('file.csv', index= False)
read = pd.read_csv(r"C:\Users\admin\Documents\python\Pandas\file.csv")
read

   Employee_ID Employee name Department  Salary  Age    Name1
0          101          John         HR   60000   35     JOHN
1          102         Emily    Finance   70000   28    EMILY
2          103       Michael         IT   80000   42  MICHAEL
3          104         Sarah  Marketing   75000   30    SARAH
4          105         David      Sales   65000   38    DAVID

In [ ]:
#13. How do you calculate the mean salary of employees in the DataFrame?

print(df['Salary'].mean())

70000.0

In [ ]:
#14. How can you find the oldest employee in the DataFrame?

df[df['Age']>=42]

   Employee_ID Employee name Department  Salary  Age    Name1
2          103       Michael         IT   80000   42  MICHAEL

In [ ]:
df.nlargest(2,'Age')

   Employee_ID Employee name Department  Salary  Age    Name1
2          103       Michael         IT   80000   42  MICHAEL
4          105         David      Sales   65000   38    DAVID

In [ ]:
#15. How do you count the number of employees in each department?
employee_count = df.groupby('Department')['Employee name'].count()

print(employee_count)

Department
Finance      1
HR           1
IT           1
Marketing    1
Sales        1
Name: Employee name, dtype: int64

In [ ]:
#16. How can you find the employee with the highest salary?
max_salary = df['Salary'].max()

highest_paid_employee = df[df['Salary'] == max_salary]

print(highest_paid_employee)

   Employee_ID Employee name Department  Salary  Age    Name1
2          103       Michael         IT   80000   42  MICHAEL

In [ ]:
#17. What is the median age of employees?
median_age = df['Age'].median()

median_age_employee = df[df['Age']==median_age]

print(median_age_employee)

   Employee_ID Employee name Department  Salary  Age Name1
0          101          John         HR   60000   35  JOHN

In [ ]:
#18.What is the maximum salary in the Sales department?

df.groupby('Department')['Salary'].max()

Department
Finance      70000
HR           60000
IT           80000
Marketing    75000
Sales        65000
Name: Salary, dtype: int64

In [ ]:
#19.How do you reset the index of the DataFrame?

df.reset_index(drop=True , inplace=False)
df

   Employee_ID Employee name Department  Salary  Age    Name1
0          101          John         HR   60000   35     JOHN
1          102         Emily    Finance   70000   28    EMILY
2          103       Michael         IT   80000   42  MICHAEL
3          104         Sarah  Marketing   75000   30    SARAH
4          105         David      Sales   65000   38    DAVID